In [2]:
# Initialize Otter
import otter
grader = otter.Notebook("pandasIntro.ipynb")

## Lecture Section

We will practice working with different Python libraries, packages, and modules in the next several lectures. It is impossible to teach every function, class, and tool available to you from all that we will cover. Instead, we will focus on the most important, common, and useful aspects. The documentation for the library/package/module and other resources will be shared at the end of each lecture.

In this lecture, we will cover:
* The differences between libraries, packages, and modules.
* `pandas` library, including:
    * Series & DataFrames
    * Reading data into a DataFrame
    * Gaining basic information from a dataset

### Libraries vs. Package vs. Module

Before we dig in, let's talk about the difference between a module, package, and library.

* **Modules** are `.py` files that contain functions, classes, and other code.
* **Packages** are collections of modules.
* **Libraries** are collections of packages.

In Python, **library** and **package** are often used interchangeably. You can make your own, but we will only be working with packages already available to you. We will also work with a few modules. The packages we will use are kept up to date by the package owner, and they are all documented online. The modules come built-in to your Python install.

### pandas

pandas is an open-source library for data analysis and manipulation in Python. To use it, we need to `import` it. To save some time, we will import pandas with the alias **pd**

In [3]:
import pandas as pd

There are two important data structures that are specific to pandas: series and dataframe.

**Series:** are similar to columns in a table. They are structured like a Python list, and they can have a header (column-name). They also have an index, like the line numbers in Excel. We can change the indexing, too.

**Dataframes** are created from series. They are the most common data-structure you will see. They create a matrix/table of series.

In [4]:
a = [1, 2, 3, 4]
pd_series = pd.Series(a)
pd_series

0    1
1    2
2    3
3    4
dtype: int64

We can change the indexing with the `index` argument, and we can change the column name with `name`.

In [5]:
pd_series = pd.Series(a, index=["a", "b", "c", "d"], name = "column1")
pd_series

a    1
b    2
c    3
d    4
Name: column1, dtype: int64

If we want to access a specific value at a specific index, we would just index into the series like we would a dictionary (or list).

In [6]:
pd_series['c']

np.int64(3)

To create a dataframe, we use `{}` to create a dictionary object. The keys are the name of the columns, and the lists that follow hold the data for the respective column.

To convert to a pandas DataFrame object, we use `pd.DataFrame()` and we pass our dictionary as the argument.

In [7]:
data_ex = {
  "mph": [70, 85.3, 65.5],
  "duration": [50, 40, 45],
    "vehicle": ["car", "truck", "bus"]
}

dataframe_ex = pd.DataFrame(data_ex)
dataframe_ex

    mph  duration vehicle
0  70.0        50     car
1  85.3        40   truck
2  65.5        45     bus

Dataframes need to have the same number of rows for each column. If data is missing, use `None`. It will be converted to `NaN` in the Dataframe.

In [8]:
data_ex2 = {
  "mph": [70, 85.3, 65.5],
  "duration": [50, None, 45],
    "vehicle": ["car", "truck", "bus"]
}

dataframe_ex2 = pd.DataFrame(data_ex2)
dataframe_ex2

    mph  duration vehicle
0  70.0      50.0     car
1  85.3       NaN   truck
2  65.5      45.0     bus

We can use `.loc[]` to return a row of data as a Series. Don't use `.loc()` - it will return the memory location of the object.

In [9]:
dataframe_ex.loc[1]

mph          85.3
duration       40
vehicle     truck
Name: 1, dtype: object

In [10]:
dataframe_ex.loc[[0, 1]] # a range of rows

    mph  duration vehicle
0  70.0        50     car
1  85.3        40   truck

In [11]:
dataframe_ex.loc[1, "vehicle"] # the rows & specific column

'truck'

We can change indexes in Dataframes, too.

In [12]:
dataframe_ex3 = pd.DataFrame(data_ex2, index=["a", "b", "c"])
dataframe_ex3

    mph  duration vehicle
a  70.0      50.0     car
b  85.3       NaN   truck
c  65.5      45.0     bus

In [13]:
dataframe_ex3.loc['b'] # .loc[] again!

mph          85.3
duration      NaN
vehicle     truck
Name: b, dtype: object

Possibly the most useful aspect of Pandas is its ability to read a file into a DataFrame object.

In [14]:
df = pd.read_csv('data/disney_princess_popularity_dataset_300_rows.csv')
df

,PrincessName,FirstMovieTitle,FirstMovieYear,MovieRuntimeMinutes,NumberOfSongs,HasSoloSong,HasDuet,HairColor,EyeColor,OutfitPrimaryColor,...,RottenTomatoesScore,BoxOfficeMillions,AvgScreenTimeMinutes,NumMerchItemsOnAmazon,GoogleSearchIndex2024,InstagramFanPages,TikTokHashtagViewsMillions,Top3Hashtags,IsIconic,PopularityScore
0,Pocahontas,Pocahontas's Adventure,1977,85,4,No,Yes,Brown,Green,Pink,...,88,661,25,2524,68,298,481,#TeamPocahontas #LovePocahontas #PocahontasFor...,Yes,88
1,Mulan,Mulan's Adventure,1995,85,1,Yes,Yes,Blonde,Brown,Purple,...,91,688,52,4202,49,133,619,#TeamMulan #LoveMulan #MulanForever,Yes,78
2,Raya,Raya's Adventure,1989,110,4,No,No,Blonde,Hazel,Pink,...,76,790,54,525,68,129,230,#TeamRaya #LoveRaya #RayaForever,No,53
3,Anna,Anna's Adventure,1940,78,1,No,No,Brown,Grey,Green,...,70,820,42,1951,73,138,697,#TeamAnna #LoveAnna #AnnaForever,Yes,84
4,Mulan,Mulan's Adventure,1943,103,7,No,Yes,White,Brown,Green,...,86,996,55,3958,34,155,200,#TeamMulan #LoveMulan #MulanForever,Yes,71
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
295,Merida,Merida's Adventure,2001,95,7,Yes,No,Red,Grey,Purple,...,89,309,49,3638,98,225,881,#TeamMerida #LoveMerida #MeridaForever,No,95
296,Belle,Belle's Adventure,2006,76,1,Yes,No,Red,Green,Yellow,...,97,406,53,1558,33,270,274,#TeamBelle #LoveBelle #BelleForever,No,96
297,Anna,Anna's Adventure,2020,70,2,No,Yes,White,Blue,Blue,...,72,935,25,1815,53,53,164,#TeamAnna #LoveAnna #AnnaForever,Yes,67
298,Tiana,Tiana's Adventure,1937,71,7,No,No,Red,Blue,Purple,...,86,463,54,2365,35,116,584,#TeamTiana #LoveTiana #TianaForever,No,76
299,Mulan,Mulan's Adventure,1938,105,3,No,No,Brown,Brown,Purple,...,77,195,42,2218,89,11,540,#TeamMulan #LoveMulan #MulanForever,No,69

We can use `.head()` and `.tail()` to get the first or last 5 rows of the dataset, respectively. If we pass an integer as an argument, it will return that many rows instead.

In [15]:
df.head()

,PrincessName,FirstMovieTitle,FirstMovieYear,MovieRuntimeMinutes,NumberOfSongs,HasSoloSong,HasDuet,HairColor,EyeColor,OutfitPrimaryColor,...,RottenTomatoesScore,BoxOfficeMillions,AvgScreenTimeMinutes,NumMerchItemsOnAmazon,GoogleSearchIndex2024,InstagramFanPages,TikTokHashtagViewsMillions,Top3Hashtags,IsIconic,PopularityScore
0,Pocahontas,Pocahontas's Adventure,1977,85,4,No,Yes,Brown,Green,Pink,...,88,661,25,2524,68,298,481,#TeamPocahontas #LovePocahontas #PocahontasFor...,Yes,88
1,Mulan,Mulan's Adventure,1995,85,1,Yes,Yes,Blonde,Brown,Purple,...,91,688,52,4202,49,133,619,#TeamMulan #LoveMulan #MulanForever,Yes,78
2,Raya,Raya's Adventure,1989,110,4,No,No,Blonde,Hazel,Pink,...,76,790,54,525,68,129,230,#TeamRaya #LoveRaya #RayaForever,No,53
3,Anna,Anna's Adventure,1940,78,1,No,No,Brown,Grey,Green,...,70,820,42,1951,73,138,697,#TeamAnna #LoveAnna #AnnaForever,Yes,84
4,Mulan,Mulan's Adventure,1943,103,7,No,Yes,White,Brown,Green,...,86,996,55,3958,34,155,200,#TeamMulan #LoveMulan #MulanForever,Yes,71

In [16]:
df.tail(3)

,PrincessName,FirstMovieTitle,FirstMovieYear,MovieRuntimeMinutes,NumberOfSongs,HasSoloSong,HasDuet,HairColor,EyeColor,OutfitPrimaryColor,...,RottenTomatoesScore,BoxOfficeMillions,AvgScreenTimeMinutes,NumMerchItemsOnAmazon,GoogleSearchIndex2024,InstagramFanPages,TikTokHashtagViewsMillions,Top3Hashtags,IsIconic,PopularityScore
297,Anna,Anna's Adventure,2020,70,2,No,Yes,White,Blue,Blue,...,72,935,25,1815,53,53,164,#TeamAnna #LoveAnna #AnnaForever,Yes,67
298,Tiana,Tiana's Adventure,1937,71,7,No,No,Red,Blue,Purple,...,86,463,54,2365,35,116,584,#TeamTiana #LoveTiana #TianaForever,No,76
299,Mulan,Mulan's Adventure,1938,105,3,No,No,Brown,Brown,Purple,...,77,195,42,2218,89,11,540,#TeamMulan #LoveMulan #MulanForever,No,69

Finally, we can gather basic information of our dataset by calling `.info()`.

It shows:
* The number of entries, and the range of the indexes.
* The columns and their index, name, number of non-None (NULL/Nan) values, and type.
* The count of the types
* The memory usage

In [ ]:
df.info()

## Assignment Section

**Question 1.**

For this problem, you are going to create a `pandas` dataframe called `data_ex`. It needs to have a `sales` (float), `quarter` (int), and `item` (string) column. There should be an equal number of data in each column, and there should at least 5 rows.

In [29]:
import pandas as pd

# Generating the data for the dataframe
        # Sales variable (float)
data = {'sales': [1500.50, 2300.75, 1800.00, 2100.25, 1950.80],
        # Quarter variable (integer)
        'quarter': [1, 2, 3, 4, 1],
        # Item variable (string)
        'item': ['Laptop', 'Tablet', 'Monitor', 'Keyboard', 'Mouse']
}

# Creating and displaying the pandas dataframe
dataframe_p1 = pd.DataFrame(data)
dataframe_p1

     sales  quarter      item
0  1500.50        1    Laptop
1  2300.75        2    Tablet
2  1800.00        3   Monitor
3  2100.25        4  Keyboard
4  1950.80        1     Mouse

In [30]:
grader.check("q1")

q1 results: All test cases passed!

**Question 2.**

We will borrow a dataset from Kaggle for this exercise. I have edited it for the purposes of this course.
https://www.kaggle.com/datasets/msjahid/colorado-motor-vehicle-sales-data

For this problem, you will use `pandas` to read the `"data/colorado_motor_vehicle_sales.csv"` file. Find the basic info of the dataframe, then fill in the variables with the appropriate response.

* `rows =` : give the number of rows
* `null_sales =` : give the number of null rows in the sales column
* `columns =` : give the number of columns
* `year =` : give the data-type of the column `year` (as a string or as the type object)

In [31]:
import pandas as pd
# Loading the CSV file from Kaggle
df = pd.read_csv("data/colorado_motor_vehicle_sales.csv")

# Providing the basic info of the file
print(df.info())

# Gathering the dataframe results
rows = df.shape[0]
columns = df.shape[1]
null_sales = df['sales'].isna().sum()
year = df['year'].dtype

# Printing the results of the dataframe
print("rows =", rows)
print("null_sales =", null_sales)
print("columns =", columns)
print("year =", year)

<class 'pandas.DataFrame'>
RangeIndex: 501 entries, 0 to 500
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   year     501 non-null    int64
 1   quarter  501 non-null    int64
 2   county   501 non-null    str
 3   sales    497 non-null    float64
dtypes: float64(1), int64(2), str(1)
memory usage: 15.8 KB
None
rows = 501
null_sales = 4
columns = 4
year = int64

In [32]:
grader.check("q2")

q2 results: All test cases passed!

**Question 3.** Using the dataframe you created in Question 2, create a new dataframe that consists of the old dataframe's first 5 and last 5 rows. Set `ignore_index=True` if using `.concat()`. Do not hard-code the answer.

In [39]:
import pandas as pd

# Getting the first 5 rows from the previous dataframe
first_5 = df.head(5)
# Getting the last 3 rows from the previous dataframe
last_3 = df.tail(3)

# Combining the rows into a new dataframe
new_df = pd.concat([first_5, last_3], ignore_index=True)

# Printing the results of the new dataframe
print(new_df)

   year  quarter              county        sales
0  2008        1               Adams  231609000.0
1  2008        1            Arapahoe  550378000.0
2  2008        1  Boulder/Broomfield  176771000.0
3  2008        1              Denver  200103000.0
4  2008        1             Douglas   93259000.0
5  2015        4              Pueblo   94606000.0
6  2015        4       Rest of State  157059000.0
7  2015        4                Weld  192583000.0

In [40]:
grader.check("q3")

q3 results: All test cases passed!

---

To double-check your work, the cell below will rerun all of the autograder tests.

In [42]:
grader.check_all()

q1 results: All test cases passed!

q2 results: All test cases passed!

q3 results: All test cases passed!